Repository: Rhoxolan/Structured_Cabling_Studio_Ext
Catalog: Structured Cabling Studio/Resources/Views/Calculation/Calculate.*.resx
Languages: ru, uk

source: Add cable selection recommendations
ru: Добавить рекомендации по подбору кабеля
uk: Додати рекомендаціі з підбору кабелю

source: Advanced calculation parameters
ru: Дополнительные параметры расчёта
uk: Додаткові параметри розрахунку

# Arbitary ports count per workplace
source: Allow an arbitrary ports count per 1 workplace
ru: Разрешить произвольное количество портов на 1 рабочее место
uk: Дозволити довільну кількість портів на 1 робоче місце

# Availability of technological reserve coefficient:
source: Take into account of the technological reserve coefficient:
ru: Учитывать коэффициент технологического запаса:
uk: Враховувати коефіцієнт технологічного запасу:

# AveragePermanentLink
source: Average length of the permanent link:
ru: Средняя длина постоянного линка (Permanent Link):
uk: Середня довжина постійного лінку (Permanent Link):

# CableHankMeterage
source: Cable length on 1 hank:
ru: Метраж кабеля в 1-й бухте:
uk: Метраж кабелю в 1-й бухті:

# CableQuantity
source: Necessary cable meterage:
ru: Необходимое количество кабеля:
uk: Необхідний метраж кабелю:

source: Cable selection recommendations:
ru: Рекомендации по подбору кабеля:
uk: Рекомендаціі по підбору кабелю:

source: Calculate
ru: Рассчитать
uk: Розрахувати

# Calculation page title
source: Calculation
ru: Расчёт
uk: Розрахунок

source: Clean output block
ru: Очистить блок вывода
uk: Очистити блок виводу

# Consider standard fire safety requirements
source: Consider the standard fire safety requirements
ru: Учитывать стандартные требования к пожарной безопасности
uk: Враховувати стандартні вимогу до пожарної безпеки

# Hank length
source: Length
ru: Метраж
uk: Метраж

# HankQuantity
source: Necessary cable hank count:
ru: Необходимое количество бухт кабеля:
uk: Небхідна кількість бухт кабелю:

# Insulation Material
source: Recommended cable insluation material:
ru: Рекомендуемый материал изоляции кабеля:
uk: Рекомендований матеріал ізоляції кабелю:

# Insulation Type
source: Recommended cable insluation type:
ru: Рекомендуемый тип изоляции кабеля:
uk: Рекомендований тип ізоляції кабелю:

source: m
ru: м.
uk: м.

source: Maximum length of the permanent link:
ru: Наибольшая длина постоянного линка (Permanent link):
uk: Максимальна довжина постійного лінку (Permanent link):

# MaxPermanentLink
source: Maximum length of the permanent link:
ru: Наибольшая длина постоянного линка (Permanent Link):
uk: Максимальна довжина постійного лінку (Permanent Link):

source: Minimum length of the permanent link:
ru: Наименьшая длина постоянного линка (Permanent link):
uk: Мінімальная довжина постійного лінку (Permanent link):

# MinPermanentLink
source: Minimum length of the permanent link:
ru: Наименьшая длина постоянного линка (Permanent Link):
uk: Мінімальная довжина постійного лінку (Permanent Link):

# NumberOfPorts
source: Ports count per 1 workplace:
ru: Количество портов на 1 рабочее место:
uk: Кількість портів на 1 робоче місце:

# NumberOfWorkplaces
source: Workplaces count:
ru: Количество рабочих мест:
uk: Кількість робочих місць:

source: Ports count per 1 workplace:
ru: Количество портов на 1 рабочее место:
uk: Кількість портів на 1 робоче місце:

# RecordTime
source: Date and time of structured cabling confiruration record:
ru: Дата и время записи конфигурации СКС:
uk: Час та дата запису конфигураціі СКС:

source: Restore defaults
ru: Восстановить значения по умолчанию
uk: Відновити дефолтні значення

source: Save to TXT
ru: Сохранить в TXT
uk: Зберегти у TXT

# Shielding
source: Recommended cable shielding type:
ru: Рекомендуемый тип экранизации кабеля:
uk: Рекомендований тип екранізаціі кабелю:

# Standart
source: Recommended cable category:
ru: Рекомендуемая категория кабеля:
uk: Рекомендована категорія кабелю:

source: Standart values
ru: Стандартные значения
uk: Стандартні значення

# Strict compliance with the standart
source: Strict compliance with the ISO/IEC 11801 standart
ru: Строгое соответствие стандарту ISO/IEC 11801
uk: Дотримання відповідності стандарту ISO/IEC 11801

source: Take into account the cable hank meterage
ru: Учитывать метраж кабеля в бухте
uk: Враховувати метраж кабелю в бухті

source: Take into account the necessity of cable shielding
ru: Учитывать необходимость экранизации кабеля
uk: Враховувати необхідність екранізаціі кабелю

source: The standard values of a cable hank length
ru: Стандартные значения метража кабеля в бухте
uk: Стандартні значенния метража кабелю у бухті

# TotalCableQuantity
source: Total necessary cable meterage:
ru: Итоговое необходимое количество кабеля:
uk: Загальна необхідна кількість кабелю:

source: Used connection interfaces
ru: Используемые интерфейсы подключений
uk: Інтерфейси підключені, які використовуються

source: Will the sections of the cable route run outdoors
ru: Будут ли участки кабельной трассы проходить вне помещения
uk: Чи будуть ділянки кабельної траси проходити поза приміщенням

source: Workplaces count:
ru: Количество рабочих мест:
uk: Кількість робочих місць:
