Repository: Rhoxolan/Structured_Cabling_Studio_Ext
Catalog: Structured Cabling Studio/Resources/Views/Project/ProjectInformation.*.resx
Languages: ru, uk

source: Author of project
ru: Автор проекта
uk: Автор проекту

source: E-Mail
ru: Электронная почта
uk: Електронна пошта

# Eight paragraph &amp; link to the SCS-Calc 2.0 repo
source: The release of the SCS-Calc application 2.0 took place in February 2023. Additionally, the application has become the subject of a coursework on the .NET platform at the STEP IT Academy in Kryvyi Rih.<br/> You can find more detailed information about the application on GitHub
ru: Релиз приложения SCS-Calc 2.0 состоялся в феврале 2023-го. По совместительству, приложение стало предметом курсовой работы по платформе .NET в Компьютерной Академии ШАГ г. Кривой Рог.<br /> Более подробно ознакомиться с приложением можно на GitHub
uk: Реліз додатку SCS-Calc 2.0 відбувся у лютому 2023-го. За сумісництвом, застосунок став предметом курсової роботи з платформи .NET у Комп'ютерній Академії ШАГ м. Кривий Ріг.<br/> Більш детально з додатком можна ознайомитись на GitHub

# Fifth paragraph - link to the SCS-Calc 1.1 repo
source: The source code of the SCS-Calc 1.1 is available on GitHub
ru: Код приложения SCS-Calc 1.1 доступен на GitHub
uk: Код застосунку SCS-Calc 1.1 доступний на GitHub

# First paragraph
source: In August 2021, while working on the coursework on the "Structured cabling" subject at the STEP IT Academy in Kryvyi Rih, there was a need to develop software for calculation of necessary cable meterage for building of a structured cabling. The first version of the application was created - the console application on C++, which was named SCS-Calc.
ru: В августе 2021-го, во время написания курсовой работы по предмету "Структурированные кабельные системы" в Компьютерной Академии ШАГ г. Кривой Рог, возникла необходимость в создании программного обеспечения для расчёта необходимого для построения СКС метража кабеля. Была написана первая версия приложения - консольное приложение на языке C++, которое получило название SCS-Calc.
uk: У серпні 2021-го, під час написання курсової роботи з предмету "Структуровані кабельні системи" у Комп'ютерній Академії ШАГ м.Кривий Ріг, з'явилася необхідність у створенні програмного забезпечення для розрахунку необхідного для побудови СКС метражу кабелю. Була написана перша версія застосунку - консольний додаток на мові C++, який отримав назву SCS-Calc.

# First&amp;second image description
source: The first console version of the SCS-Calc application
ru: Первая, консольная версия приложения SCS-Calc
uk: Перша, консольна версія додатку SCS-Calc

# Fourth paragraph
source: The project continued to evolve. In August 2022, work on the version 1.1 was began. One of the main development directions was the creation of an additional parameters menu, where users could customize calculation settings.<br/> During the development of version 1.1, work on the new architectural concept of the project was began. To be able to port the application to other development platforms, work has begun on the creation of the cross-platform library that is independent of the type of application and contains the application logic model. This played a significant role in the next versions of the project, allowing the logical core of the application to be ported to other platforms.
ru: Проект развивался. В августе 2022-го была начата работа над версией 1.1. Одним из основных направлений разработки было создание меню дополнительных параметров, где пользователь мог настроить параметры расчета.<br/> При работе над версией 1.1 началась работа над новой архитектурной концепцией проекта. Для возможности переноса приложения на другие платформы разработки, была начата работа над созданием независимой от типа приложения кроссплатформенной библиотеки, содержащей модель логики работы приложения. Это сыграло значительную роль в следующих версиях проекта, позволив переносить логическое ядро приложения на другие платформы.
uk: Проект мав розвиток. У серпні 2022-го була почата праця над версією 1.1. Одним з основних напрямків розробки будо створення меню додаткових параметрів, де користувач мав змогу налаштувати параметри розрахунку.<br/> При роботі над версією 1.1 почалася праця над новою архітектурною концепцією проекту. Для можливості переносу додатку на інші платформи розробки, була начата праця над створенням незалежної від типу додатку кросплатформенної бібліотеки, що містить логіку роботи застосунку. Це зіграло значну роль у наступних версіях проекту, давши змогу переносити логічне ядро застосунку на інші платформи.

# History of project
source: The history of project
ru: История проекта
uk: Історія проекту

source: Img.
ru: Рис.
uk: Рис.

# Ninth paragraph - link to the Structured Cabling Studio repo
source: After the release of SCS-Calc 2.0, as a conceptual continuation of the project, the idea of developing a web application emerged. In March 2023, work on the Structured Cabling Studio project was began on the .NET 7 ASP.NET Core platform.<br/> The release took place in May 2023. Inheriting the concept from the desktop versions of the project, Structured Cabling Studio provides extensive functionality for calculating necessary cable meterage for building of a structured cabling and obtaining cable selection recommendations.<br/> You can explore the source code of the Structured Cabling Studio project on GitHub
ru: После релиза SCS-Calc 2.0, в качестве концептуального развития проекта, возникла идея реализации веб-приложения. В марте 2023-го, на платформе .NET 7 ASP.NET Core была начата работа над веб-проектом Structured Cabling Studio.<br /> Релиз проекта состоялся в мае 2023-го. Унаследовав концепцию от десктопных версий проекта, Structured Cabling Studio предоставляет широкий функционал расчета необходимого метража кабеля для построения СКС и получения рекомендаций по подбору кабеля.<br/> С кодом проекта Structured Cabling Studio можно ознакомится на GitHub
uk: Після релізу SCS-Calc 2.0, в якості концептуального розвитку проекту, з'явилася ідея реалізації веб-застосунку. У березні 2023-го, на платформі .NET 7 ASP.NET Core, була начата робота над веб-проектом Structured Cabling Studio.<br/> Реліз проекту відбувся у травні 2023-го. Успадкувавши концепцію від десктопних версій проекту, Structured Cabling Studio надає широкий функціонал розрахунку необхідного метражу кабелю для побудови СКС і отримання рекомендацій з підбору кабелю.<br/> З кодом проекту Structured Cabling Studio можна ознайомитись на GitHub

source: Profile
ru: Профиль
uk: Профіль

# Project Information page title
source: Project Information
ru: Информация о проекте
uk: Інформація про проект

# Second paragraph
source: However, already at that time, there was an understanding that the first priority was to create a application with a graphical user interface.<br/> This was accomplished in June 2022 - the first version of the application with a graphical user interface was developed on the .NET 6 Windows Forms platform using the C# language. The application was got 1.0 release index.
ru: Однако, уже тогда было понимание того, что необходимо, в первую очередь, приложение с графическим интерфейсом пользователя.<br/> Что и было сделано в июне 2022-го - на языке C#, на платформе .NET 6 Windows Forms, была написана первая версия приложения с графическим интерфейсом пользователя. Приложение получило релизный индекс 1.0.
uk: Однак вже тоді було розуміння того, що потрібен, в першу чергу, застосунок з графічним інтерфейсом користувача.<br/> Що і було зроблено в червні 2022-го - на мові C#, на платформі .NET 6 Windows Forms, була написана перша версія застосуноку с графічним інтерфейсом користувача. Застосунок отримав релізний індекс 1.0.

# Seventh paragraph
source: The SCS-Calc 2.0 application became completely new, modern, and feature-rich. The application was developed using a more modern development platform - .NET 7 WPF. The functionality of the application was significantly improved, and the ability to receive cable selection recommendations was added. The transition to the new platform enabled the implementation of a completely new, revolutionary design.
ru: Приложение SCS-Calc 2.0 стало совершенно новым, современным и функциональным приложением. Приложение было написано на более современной платформе разработки - .NET 7 WPF. В значительной степени был доработан функционал приложения, была добавлена возможность получения рекомендаций по подбору кабеля. Переход на новую платформу позволил реализовать совершенно новый, революционный дизайн.
uk: Застосунок SCS-Calc 2.0 став цілковито новим, сучасним і функціональним застосунком. Застосунок був написаний на більш сучасній платформі розробці - .NET 7 WPF. Значною мірою був допрацьований функціонал додатку, була додана можливість отримання рекомендацій з підбору кабелю. Перехід на нову платформу дав можливість реалізувати цілковито новий, революційний дизайн.

# Sixth paragraph
source: But version 1.1 was never released, as the work on version 1.1 seamlessly transitioned into the development of version 2.0.
ru: Но версия 1.1 так и не была опубликована - работа над версией 1.1 плавно перетекла в работу над версией 2.0.
uk: Но версія 1.1 так і не була опублікована - робота над версією 1.1 плавно перейшла в роботу над версією 2.0.

# Third image description
source: The SCS-Calc application - the desktop version
ru: Приложение SCS-Calc - десктопная версия
uk: Застосунок SCS-Calc - десктопна версія

# Third paragraph - link to the SCS-Calc repo
source: You can explore the SCS-Calc application in more detail on GitHub
ru: Более подробно ознакомиться с приложением SCS-Calc можно на GitHub
uk: Більш детально ознайомитись з додатком SCS-Calc можна на GitHub
